---
## Author
author:
  name: Нагорняк Арсений Евгеньевич
  email: 1032253497@pfur.ru
  affiliation:
    - name: Российский университет дружбы народов
      country: Российская Федерация
      postal-code: 117198
      city: Москва
      address: ул. Миклухо-Маклая, д. 6

## Title
title: "Отчёт по лабораторной работе №3"
license: "CC BY"
---

# Цель работы

Целью данной лабораторной работы является освоение процедуры оформления отчетов с помощью легковесного языка разметки Markdown.

# Задание

1. Установка необходимого ПО (quarto, tex)
2. Заполнение отчета по выполнению лабораторной работы №3 с помощью языка разметки Markdown
3. Задание для самостоятельной работы

# Теоретическое введение

Markdown — облегчённый язык разметки, созданный с целью обозначения форматирования в простом тексте, с максимальным сохранением его читаемости человеком, и пригодный для машинного преобразования в языки для продвинутых публикаций (HTML, Rich Text и других).

# Выполнение лабораторной работы

## Компиляция шаблонов отчета

открываем терминал и переходим в каталог курса (рис. @fig:001).

![Обновление изменений в директории курса](image/01.png){#fig:001 width=70%}

Провожу компиляцию отчета с помощью команды make all (рис. @fig:002).

![Компиляция (image/02.png){#fig:002 width=70%}

удаляем лишние файлы и проверяем результат (рис. @fig:003).

![Проверка файлов](image/03.png){#fig:003 width=70%}


Выполняем отчет с помощью редактора (рис. @fig:004).

![Редактирование отчета](image/04.png){#fig:004 width=70%}


# Задания для самостоятельной работы

Аналогично выполнению отчета по текущей лабораторной работе, я выполняю отчет в markdown и по второй лабораторной работе, для этого перехожу в директорию 2 лабораторной работы и готовлю отчет с помощью текстового редактора.
[Ссылка на GitHub](https://github.com/aenagornyak/study_2025-2026_arh-pc) https://github.com/aenagornyak/study_2025-2026_arh-pc

# Выводы

В результате выполнения данной лабораторной работы освоены процедуры оформления отчетов с помощью легковесного языка разметки Markdown.

